Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/K21.tmx
Source language: en_us
Languages: zh_cn

source: Winter dreams
zh_cn: 冬天的梦

source: Some of the caddies were poor as sin and lived in one-room houses with a neurasthenic cow in the front yard, but Dexter Green's father owned the second best grocery-store in Black Bear--the best one was "The Hub," patronized by the wealthy people from Sherry Island--and Dexter caddied only for pocket-money.
zh_cn: 尽管有的高尔夫球童家里一贫如洗，住在只有一个房间的屋子里，前院里有一头可怜的奶牛，但是德克斯特·格林的父亲拥有黑熊村一带第二好的杂货店。最好的杂货店叫做“中心”，谢利岛的有钱人经常光顾。德克斯特做球童只为了赚零花钱。

source: In the fall when the days became crisp and gray, and the long Minnesota winter shut down like the white lid of a box, Dexter's skis moved over the snow that hid the fairways of the golf course.
zh_cn: 进入秋季天气变得干冷，天空转而灰暗。明尼苏达漫长的冬天瞬间降临，像白色的盖子顺势扣下。高尔夫球场平坦球路被积雪覆盖，德克斯特的滑雪板从上面滑过。

source: At these times the country gave him a feeling of profound melancholy--it offended him that the links should lie in enforced fallowness, haunted by ragged sparrows for the long season. It was dreary, too, that on the tees where the gay colors fluttered in summer there were now only the desolate sand-boxes knee-deep in crusted ice.
zh_cn: 每当这时候，乡间使他感到深深的忧郁——让他不快的是高尔夫球场被强制处于休闲状态，在这漫长的季节里被羽毛蓬乱的麻雀们盘踞，同样沉闷异常的是夏天高尔夫球座上翻飞着欢乐的色彩，而现在只剩被埋在结实的冰面里的寂寞的沙箱。

source: When he crossed the hills the wind blew cold as misery, and if the sun was out he tramped with his eyes squinted up against the hard dimensionless glare.
zh_cn: 他在雪上迈着沉重的步子前进，穿过山丘时刺骨的冷风刮个不停；如果遇上晴天，他只得眯起眼睛来抵抗无处不在的刺眼的强光。

source: In April the winter ceased abruptly.
zh_cn: 四月里冬季戛然而止。

source: The snow ran down into Black Bear Lake scarcely tarrying for the early golfers to brave the season with red and black balls.
zh_cn: 消融的积雪流入黑熊湖，不为那些早早用红球和黑球挑战这个季节的打高尔夫球的人做分秒停留。

source: Without elation, without an interval of moist glory, the cold was gone.
zh_cn: 没有得意与喜悦，没有间隙湿润的景致，寒冷便悄然退去了。

source: Dexter knew that there was something dismal about this Northern spring, just as he knew there was something gorgeous about the fall.
zh_cn: 德克斯特知道这北地的春天有些许凄凉，就像他知道秋天有一些非同寻常。

source: Fall made him clinch his hands and tremble and repeat idiotic sentences to himself, and make brisk abrupt gestures of command to imaginary audiences and armies.
zh_cn: 秋天使得他握紧双手，激动地颤抖，对自己重复着些傻话，忽然用敏捷的动作指挥想象的观众和军队。

source: October filled him with hope which November raised to a sort of ecstatic triumph, and in this mood the fleeting brilliant impressions of the summer at Sherry Island were ready grist to his mill.
zh_cn: 十月给他注满希望，十一月里这种希望演化为一种成功的狂喜。在这样的心情下，谢利岛夏季转瞬即逝的光景对他助益颇多。

source: He became a golf champion and defeated Mr. T. A. Hedrick in a marvellous match played a hundred times over the fairways of his imagination, a match each detail of which he changed about untiringly--sometimes he won with almost laughable ease, sometimes he came up magnificently from behind.
zh_cn: 他想象着自己成为了高尔夫冠军，在一场精彩的比赛中打败了T. A.赫德里克先生。这场比赛在他想象的平坦球道上演了数百次，他不知疲倦地反复修改着每一个细节——有时候他赢得轻而易举，不费吹灰之力；有时候他奋起直追，精彩地反败为胜。

source: Again, stepping from a Pierce-Arrow automobile, like Mr. Mortimer Jones, he strolled frigidly into the lounge of the Sherry Island Golf Club-- or perhaps, surrounded by an admiring crowd, he gave an exhibition of fancy diving from the spring-board of the club raft. . . .
zh_cn: 他想象自己像蒙蒂莫·琼斯先生一样，再一次踏出“皮尔斯-银箭”轿车，冷淡而悠闲地走进谢利岛高尔夫俱乐部的休息室，又或者在仰慕的人群的注目之下,从俱乐部船上的跳板起跳，完成一次精彩的跳水......

source: Among those who watched him in open-mouthed wonder was Mr. Mortimer Jones.
zh_cn: 而蒙蒂莫·琼斯先生也在那群惊讶得合不拢嘴的人之中。

source: And one day it came to pass that Mr. Jones--himself and not his ghost-- came up to Dexter with tears in his eyes and said that Dexter was the----best caddy in the club, and wouldn't he decide not to quit if Mr. Jones made it worth his while, because every other caddy in the club lost one ball a hole for him-- regularly----
zh_cn: 有一天琼斯先生——他本人而不是他的幻影——含泪找到德克斯特，说他是俱乐部里最好的球童，如果支付足够多的钱他能不能决定继续干下去呢？因为俱乐部里的其他球童通常每洞都丢过一个球。

source: "No, sir," said Dexter decisively, "I don't want to caddy any more."
zh_cn: “不，先生”德克斯特果断地回答，“我不想再做球童了。”

source: Then, after a pause: "I'm too old."
zh_cn: 短暂的沉默之后他说：“我太老了。”

source: "You're not more than fourteen.
zh_cn: “你还不到十四岁!

source: Why the devil did you decide just this morning that you wanted to quit? You promised that next week you'd go over to the State tournament with me."
zh_cn: 你怎么今早就忽然决定不干了呢？你还答应了下周要过来跟我一起参加全州锦标赛。”

source: "I decided I was too old."
zh_cn: “我觉得我太老了。”

source: Dexter handed in his "A Class" badge, collected what money was due him from the caddy master, and walked home to Black Bear Village.
zh_cn: 德克斯特交回他的A等奖章，带着从球童主管那儿领来的自己应得的报酬，一路走回在黑熊村的家。

source: "The best----caddy I ever saw," shouted Mr. Mortimer Jones over a drink that afternoon.
zh_cn: “我见过的最好的球童” 那个下午蒙蒂莫·琼斯喝完一杯酒之后叫道。

source: "Never lost a ball! Willing! Intelligent! Quiet! Honest! Grateful!"
zh_cn: “从来没丢过一个球！积极、聪明、不多嘴、诚实，懂得感恩。”

source: The little girl who had done this was eleven--beautifully ugly as little girls are apt to be who are destined after a few years to be inexpressibly lovely and bring no end of misery to a great number of men.
zh_cn: 使这一切发生的小女孩11岁，现在的模样尽管可爱但还有点丑，她像那些注定几年后出落得明艳可爱，美丽得不可方物的小女孩一样，将来会给许多男人带来无尽的痛苦。

source: The spark, however, was perceptible.
zh_cn: 然而现在，她美貌的已经初见端倪。

source: There was a general ungodliness in the way her lips twisted ,down at the corners when she smiled, and in the--Heaven help us!--in the almost passionate quality of her eyes.
zh_cn: 她笑起来的时候嘴角略微朝下弯，给人以邪恶的感觉，她眼里洋溢着近乎热情的活力，好像在说“老天快帮帮我们”。

source: Vitality is born early in such women. It was utterly in evidence now, shining through her thin frame in a sort of glow.
zh_cn: 这样的女人很早就被赋予了活力，如今这份活力已经显而易见，从她纤细的身体由内而外焕发着迷人的光彩。

source: She had come eagerly out on to the course at nine o'clock with a white linen nurse and five small new golf-clubs in a white canvas bag which the nurse was carrying.
zh_cn: 她早早地出来，九点钟就跟穿白亚麻衣服的保姆到了高尔夫球场。 保姆拿着一个白色的帆布袋，里面装着五支崭新的高尔夫球杆。

source: When Dexter first saw her she was standing by the caddy house, rather ill at ease and trying to conceal the fact by engaging her nurse in an obviously unnatural conversation graced by startling and irrelevant grimaces from herself.
zh_cn: 德克斯特第一次见到她的时候她站在球童房旁边，十分局促，用吃惊和苦着脸的表情竭力掩饰着与保姆明显不自然的对话。

source: "Well, it's certainly a nice day, Hilda," Dexter heard her say.
zh_cn: “今天天气真好呢，希尔达。”德克斯特听见了她说的话。

source: She drew down the corners of her mouth, smiled, and glanced furtively around, her eyes in transit falling for an instant on Dexter.
zh_cn: 她嘴角浅浅朝下一牵，露出一个微笑。她暗自打量四周，双眼在特克斯特身上停留了一瞬。

source: Then to the nurse: "Well, I guess there aren't very many people out here this morning, are there?"
zh_cn: 然后转向保姆说：“那么，我猜今早这儿不会有太多人来打球，是吗？”

source: The smile again--radiant, blatantly artificial--convincing.
zh_cn: 她又露出了一模一样的微笑——光彩照人，刻意精雕细琢的笑——却令人信服。

source: "I don't know what we're supposed to do now," said the nurse, looking nowhere in particular.
zh_cn: “我不知道我们接下来该做什么，”保姆说着，眼神漫无目的。

source: "Oh, that's all right.
zh_cn: “噢，没关系。

source: I'll fix it up.
zh_cn: 我会解决的。”

source: Dexter stood perfectly still, his mouth slightly ajar.
zh_cn: 德克斯特嘴微张着，站得纹丝不动。

source: He knew that if he moved forward a step his stare would be in her line of vision--if he moved backward he would lose his full view of her face.
zh_cn: 他知道如果上前一步，他直直的眼神便会落进她的视线里——如果退后，就无法看到她的脸了。

source: For a moment he had not realized how young she was.
zh_cn: 有那么一瞬间，他没意识到她才多小。

source: Now he remembered having seen her several times the year before in bloomers.
zh_cn: 现在他记起来去年见过她好几次——那时候她穿着灯笼裤。

source: Suddenly, involuntarily, he laughed, a short abrupt laugh-- then, startled by himself, he turned and began to walk quickly away.
zh_cn: 忽然间他不由自主地笑了，短暂、突然地笑了。随之他被自己吓了一跳，他转过身，迅速地迈着步子走开了。

source: "Boy!"
zh_cn: “球童！”

source: Dexter stopped.
zh_cn: 德克斯特止步。

source: "Boy----"
zh_cn: “球童......”

source: Beyond question he was addressed.
zh_cn: 毫无疑问，她跟他说话了。

source: Not only that, but he was treated to that absurd smile, that preposterous smile--the memory of which at least a dozen men were to carry into middle age.
zh_cn: 不只是那样，他被那个奇怪的微笑所俘获——那个荒谬之极的微笑，至少数十个男人会把那个笑容的短暂的回忆带至他们的中年时代。

source: "Boy, do you know where the golf teacher is?"
zh_cn: “球童，你知道高尔夫教练在哪儿吗？“

source: "He's giving a lesson."
zh_cn: “他在上课。”

source: "Well, do you know where the caddy-master is?"
zh_cn: “那你知道球童主管在哪儿吗？“

source: "He isn't here yet this morning."
zh_cn: “今早他还没出现。”

source: "Oh." For a moment this baffled her.
zh_cn: “喔。”这个答案让她迟疑了一会儿。

source: She stood alternately on her right and left foot.
zh_cn: 她轮流倚着左右腿站着。

source: "We'd like to get a caddy," said the nurse.
zh_cn: “我们想找一个球童，”保姆说。

source: "Mrs. Mortimer Jones sent us out to play golf, and we don't know how without we get a caddy."
zh_cn: “琼斯夫人让我们出来打高尔夫球，可是没有球童的话恐怕我们不知道该怎么办。”

source: Here she was stopped by an ominous glance from Miss Jones, followed immediately by the smile.
zh_cn: 保姆停住了，因为琼斯小姐撇来不善的目光，虽然紧接着她露出了微笑。

source: "There aren't any caddies here except me," said Dexter to the nurse, "and I got to stay here in charge until the caddy-master gets here."
zh_cn: “除了我这儿没有其他球童，”德克斯特对保姆说，“我负责这里，直到球童主管来。”

source: "Oh."
zh_cn: “哦。”

source: Miss Jones and her retinue now withdrew, and at a proper distance from Dexter became involved in a heated conversation, which was concluded by Miss Jones taking one of the clubs and hitting it on the ground with violence.
zh_cn: 此时琼斯小姐和她的陪同退下了，距离德克斯特有一定的距离，爆发了一场激烈的争吵。琼斯小姐拿起一根球杆，猛地敲向地面，结束了他们的对话。

source: For further emphasis she raised it again and was about to bring it down smartly upon the nurse's bosom, when the nurse seized the club and twisted it from her hands.
zh_cn: 为了进一步强调，她又再次举起球杆。保姆伸手抓住球杆扭在手里的时候，琼斯小姐的球杆正要朝保姆的胸前落下去。

source: "You damn little mean old thing!" cried Miss Jones wildly.
zh_cn: “你这个该死的可恶的老东西！”琼斯小姐大声叫到。

source: Another argument ensued.
zh_cn: 紧接着又发生了一场争吵。

source: Realizing that the elements of the comedy were implied in the scene, Dexter several times began to laugh, but each time restrained the laugh before it reached audibility.
zh_cn: 觉察到眼前这一幕的喜剧成分之后，德克斯特好几次要发笑，但每次都在笑出声之前忍住了。

source: He could not resist the monstrous conviction that the little girl was justified in beating the nurse.
zh_cn: 他竟然产生了难以置信的认同，觉得这个小女孩打保姆有着充分的理由。

source: The situation was resolved by the fortuitous appearance of the caddymaster, who was appealed to immediately by the nurse.
zh_cn: 这局面被碰巧出现的球童主管化解了，保姆马上注意到了他。

source: "Miss Jones is to have a little caddy, and this one says he can't go."
zh_cn: “琼斯小姐需要一个球童，但是眼前这个说他不能去。”

source: "Mr. McKenna said I was to wait here till you came," said Dexter quickly.
zh_cn: “麦肯纳先生让我在这儿等你来”， 德克斯特迅速回答。

source: "Well, he's here now." Miss Jones smiled cheerfully at the caddy-master.
zh_cn: “好了，他现在已经来了。”琼斯小姐朝球童主管开心地笑到。

source: Then she dropped her bag and set off at a haughty mince toward the first tee.
zh_cn: 接着她扔下她的球杆袋，傲慢地朝着第一个球座走去。

source: "Well?" The caddy-master turned to Dexter. "What you standing there like a dummy for? Go pick up the young lady's clubs."
zh_cn: “唷？”球童领队转向德克斯特，“你还像个傻瓜一样站在这儿干嘛？还不去把那位年轻女士的球杆捡起来？”

source: "I don't think I'll go out to-day," said Dexter.
zh_cn: “我不认为我今天要去球场。”德克斯特说。

source: "You don't----
zh_cn: “你不去......”

source: " "I think I'll quit."
zh_cn: “我不干了。”

source: The enormity of his decision frightened him.
zh_cn: 这个重大的决定吓到了他。

source: He was a favorite caddy, and the thirty dollars a month he earned through the summer were not to be made elsewhere around the lake.
zh_cn: 他是最受欢迎的球童，夏天湖区一带没有其他任何地方能挣到三十美元。

source: But he had received a strong emotional shock, and his perturbation required a violent and immediate outlet.
zh_cn: 但是他受到了巨大的情感的惊吓，他混乱不宁的情绪需要立刻猛烈地宣泄出来。

source: It is not so simple as that, either.
zh_cn: 这绝非那么简单。

source: As so frequently would be the case in the future, Dexter was unconsciously dictated to by his winter dreams.
zh_cn: 正像将来会无数次发生的那样，德克斯特无意识地被他的冬天的梦支配着。

source: NOW, OF COURSE, the quality and the seasonability of these winter dreams varied, but the stuff of them remained.
zh_cn: 现在，当然这些冬天的梦的细节和季节都不同了，但是他们的内容并没有变。

source: They persuaded Dexter several years later to pass up a business course at the State university--his father, prospering now, would have paid his way--for the precarious advantage of attending an older and more famous university in the East, where he was bothered by his scanty funds.
zh_cn: 他们说服德克斯特在几年后拒绝州立大学的商业课程——他的父亲现在变得富裕了，能够维持他的生活开销——为了那并不确定的优势选择东部更具历史更有名的学校，在那儿他因为囊中羞涩而烦恼。

source: But do not get the impression, because his winter dreams happened to be concerned at first with musings on the rich, that there was anything merely snobbish in the boy.
zh_cn: 但是别形成那种印象，因为他的冬天的梦最初碰巧与他关于富人的思考有关，那仅仅是男孩的势利眼。

source: He wanted not association with glittering things and glittering people--he wanted the glittering things themselves.
zh_cn: 他并不想与那些闪闪发光的事物和人们熟识，他想要的只是那些闪闪发光的东西本身。

source: Often he reached out for the best without knowing why he wanted it--and sometimes he ran up against the mysterious denials and prohibitions in which life indulges.
zh_cn: 通常他只追求最好的事物，却不知道他想要他们的原因，并且有时候他遭遇命运纵容下令人费解的拒绝和禁止。

source: It is with one of those denials and not with his career as a whole that this story deals.
zh_cn: 总体上，这个故事讲述的正是这些拒绝的其中之一，而不是他的事业。

source: He made money. It was rather amazing.
zh_cn: 非常出人意料，他赚到了钱。

source: After college he went to the city from which Black Bear Lake draws its wealthy patrons.
zh_cn: 毕业之后他来到了被黑熊湖吸引的富有的赞助者们所在的城市。

source: When he was only twenty-three and had been there not quite two years, there were already people who liked to say: "Now there's a boy--"
zh_cn: 当他仅仅23岁，到那儿还不到两年的时候已经有人常说：“现在这儿有一个年轻人......”

source: All about him rich men's sons were peddling bonds precariously, or investing patrimonies precariously, or plodding through the two dozen volumes of the "George Washington Commercial Course," but Dexter borrowed a thousand dollars on his college degree and his confident mouth, and bought a partnership in a laundry.
zh_cn: 他周围有钱人的儿子们有的瞄准机会买卖股票，有的投资祖产，有的埋头于二十四卷“乔治华盛顿商业课程”，但是德克斯特凭借他的学位和自信的口才借到了一千美元，买下了一家洗衣店的股权。

source: It was a small laundry when he went into it but Dexter made a specialty of learning how the English washed fine woollen golf-stockings without shrinking them, and within a year he was catering to the trade that wore knickerbockers.
zh_cn: 他接手的时候那不过是一家小型洗衣店，但德克斯特从英国人那儿学到了防止细羊毛高尔夫球袜缩水的洗涤方法，使其这成为自己洗衣店的特色，并且在一年内得到了为高尔夫运动提供洗衣服务的生意。

source: Men were insisting that their Shetland hose and sweaters go to his laundry just as they had insisted on a caddy who could find golfballs.
zh_cn: 男人们坚持把他们的设得兰长袜和毛衣送到德克斯特的洗衣店，就像过去人们坚持只要能找到高尔夫球的球童一样。

source: A little later he was doing their wives' lingerie as well--and running five branches in different parts of the city.
zh_cn: 不久，德克斯特也接手了这些男人的妻子们的内衣洗衣生意。德克斯特在城里不同地方同时经营着五家洗衣店。

source: Before he was twenty-seven he owned the largest string of laundries in his section of the country.
zh_cn: 还不到二十七岁他就拥有了全国最大的连锁洗衣店。

source: It was then that he sold out and went to New York.
zh_cn: 那时他卖掉洗衣店，然后去了纽约。

source: But the part of his story that concerns us goes back to the days when he was making his first big success.
zh_cn: 但是我们关注的他的那部分故事发生在他取得第一次巨大的成功之前。

source: When he was twenty-three Mr. Hart--one of the gray-haired men who like to say "Now there's a boy"--gave him a guest card to the Sherry Island Golf Club for a week-end.
zh_cn: 他23岁时，哈特先生——那些爱说“现在，这儿有个年轻人”的白发老人们的其中一个——给了他一张谢利岛高尔夫球俱乐部的周末贵宾卡。

source: So he signed his name one day on the register, and that afternoon played golf in a foursome with Mr. Hart and Mr. Sandwood and Mr. T. A. Hedrick.
zh_cn: 于是一天他在登记薄上签上自己的名字，那天下午他、哈特先生、桑德伍德先生还有T. A. 赫德里克先生一行四人去打高尔夫球。

source: He did not consider it necessary to remark that he had once carried Mr. Hart's bag over this same links, and that he knew every trap and gully with his eyes shut--but he found himself glancing at the four caddies who trailed them, trying to catch a gleam or gesture that would remind him of himself, that would lessen the gap which lay between his present and his past.
zh_cn: 他不认为有必要说出他曾在同样的球场上为哈特先生背过球杆包，他闭着眼睛都清楚地知道每个陷阱和水沟的位置，但是他发觉自己在看着跟在他们身后的四个球童，试图从他们身上捕捉到一些瞬间或者动作，让他想起自己，填平些许过去与现在的鸿沟。

source: It was a curious day, slashed abruptly with fleeting, familiar impressions.
zh_cn: 那是耐人寻味的一天，似曾相识的印象突如其来地闪过。

source: One minute he had the sense of being a trespasser--in the next he was impressed by the tremendous superiority he felt toward Mr. T. A. Hedrick, who was a bore and not even a good golfer any more.
zh_cn: 有一瞬间他有一种作为入侵者的感觉，下一秒又被对T. A. 赫德里克先生产生的巨大的优越感所触动——他是个无聊的人，甚至再也算不上一个打高尔夫的好手。

source: Then, because of a ball Mr. Hart lost near the fifteenth green, an enormous thing happened.
zh_cn: 接下来，由于哈特先生丢失在第十五轻击区的一个球，一件大事发生了。

source: While they were searching the stiff grasses of the rough there was a clear call of "Fore!" from behind a hill in their rear.
zh_cn: 当他们在深草区的草茎间寻找球的时候，一声清楚的“前面注意”的叫声从他们身后的山坡传来。
